# Get pagecounts

In [1]:
import pandas as pd

In [28]:
page_ids_df = pd.read_csv("new_pages_with_links.csv")

In [44]:
page_ids_df.head()

         id         title  count
0  30932992  Teresa Cohen    NaN
1   4718601           NaN    NaN
2        12           NaN    NaN
3  28835856           NaN    NaN
4  17301520           NaN    NaN

In [56]:
import requests

ids = ['30932992', '4718601', '12', '28835856']

url = (
    'https://en.wikipedia.org/w/api.php'
    '?action=query'
    '&prop=info'
    '&pageids=' + '|'.join(ids) +
    '&format=json')
json_response = requests.get(url).json()

id_to_title  = {
    int(page_id) : page_info['title']
    for page_id, page_info in json_response['query']['pages'].items()}

print(id_to_title)

{12: 'Anarchism', 4718601: 'Cemaes Bay F.C.', 28835856: 'Nokia C6-01', 30932992: 'Teresa Cohen'}

In [33]:
page_ids_df.loc[page_ids_df.id == 30932992, 'title'] = 'Teresa Cohen'

In [60]:
page_ids_df.head()

         id                           title  count
0  30932992                    Teresa Cohen    NaN
1   4718601                 Cemaes Bay F.C.    NaN
2        12                       Anarchism    NaN
3  28835856                     Nokia C6-01    NaN
4  17301520  RMS Empress of Scotland (1905)    NaN

In [63]:
count = 0
batches = []
batch = []
for index, row in page_ids_df.iterrows():
    count += 1
    batch.append(row['id'])
    if count == 50:
        batches.append(batch)
        count = 0
        batch = []

In [49]:
len(batches[0])

1000

In [ ]:
for batch in batches:
    ids = [str(v) for v in batch]
    url = (
        'https://en.wikipedia.org/w/api.php'
        '?action=query'
        '&prop=info'
        '&pageids=' + '|'.join(ids) +
        '&format=json')
    json_response = requests.get(url).json()

    for page_id, page_info in json_response['query']['pages'].items():
        if 'title' in page_info:
            page_ids_df.loc[page_ids_df.id == int(page_id), 'title'] = page_info['title']

In [ ]:
page_ids_df.count()